# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\mark6\Google Drive\College-MIT\S6Spring2020\6.115\FinalProject\BunkerKnowledge\PSoC_Stick_Files\Learning_TFT_emWin.cydsn\Learning_TFT_emWin.cyprj
# Date: Thu, 23 Apr 2020 01:36:47 GMT
#set_units -time ns
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {SPIM_1_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 9} [list [get_pins {ClockBlock/dclk_glb_0}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\mark6\Google Drive\College-MIT\S6Spring2020\6.115\FinalProject\BunkerKnowledge\PSoC_Stick_Files\Learning_TFT_emWin.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\mark6\Google Drive\College-MIT\S6Spring2020\6.115\FinalProject\BunkerKnowledge\PSoC_Stick_Files\Learning_TFT_emWin.cydsn\Learning_TFT_emWin.cyprj
# Date: Thu, 23 Apr 2020 01:36:44 GMT
